TuyaInc/tuya_zigbee_sdk/silicon_labs_zigbee/sdk/platform/base/hal/plugin/serial/cortexm/efm32/com.c
  return bytesReadInternal == length ? EMBER_SUCCESS : EMBER_SERIAL_RX_EMPTY;
}

#endif // EMBER_TEST

Ecode_t COM_ReadPartialLine(COM_Port_t port, char *data, uint8_t max, uint8_t * index)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  Ecode_t err;
  uint8_t ch;

  if (((*index) == 0) || ((*index) >= max)) {
    data[0] = '\0';
  }

  for (;; ) {
    err = COM_ReadByte(port, &ch);

    // no new serial port char?, keep looping
    if (err) {
      return err;
    }

    // handle bogus characters
    if ( ch > 0x7F ) {
      continue;
    }

    // handle leading newline - fogBUGZ # 584
    if (((*index) == 0)
        && ((ch == '\n') || (ch == 0))) {
      continue;
    }

    // Drop the CR, or NULL that is part of EOL sequence.
    if ((*index) >= max) {
      *index = 0;
      if ((ch == '\r') || (ch == 0)) {
        continue;
      }
    }

    // handle backspace
    if ( ch == 0x8 || ch == 0x7F ) {
      if ((*index) > 0 ) {
        // delete the last character from our string
        (*index)--;
        data[*index] = '\0';
        // echo backspace
        COM_WriteString(port, "\b \b");
      }
      // don't add or process this character
      continue;
    }

    //if the string is about to overflow, fake in a CR
    if ((*index) + 2 > max ) {
      ch = '\r';
    }

    COM_WriteByte(port, ch);  // term char echo

    //upcase that char
    if ( ch >= 'a' && ch <= 'z') {
      ch = ch - ('a' - 'A');
    }

    // build a string until we press enter
    if ((ch == '\r') || (ch == '\n')) {
      data[*index] = '\0';

      if (ch == '\r') {
        COM_WriteByte(port, '\n');  // "append" LF
        *index = 0;                       // Reset for next line; \n next
      } else {
        COM_WriteByte(port, '\r');  // "append" CR
        *index = max;                     // Reset for next line; \r,\0 next
      }

      return EMBER_SUCCESS;
    }

    data[(*index)++] = ch;
  }
}

Ecode_t COM_ReadLine(COM_Port_t port, char *data, uint8_t max)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  uint8_t index = 0;

  while (COM_ReadPartialLine(port, data, max, &index) != EMBER_SUCCESS) {
    halResetWatchdog();
  }
  return EMBER_SUCCESS;
}

//------------------------------------------------------
// Serial Output

// returns # bytes (if fifo mode)/messages (if buffer mode) that can be written
uint16_t COM_WriteAvailable(COM_Port_t port)
{
  COM_Handle_t comhandle = getComHandleFromPort(port);
  return comhandle->txsize - comhandle->txQueue->used;
}

uint16_t COM_WriteUsed(COM_Port_t port)
{
  COM_Handle_t comhandle = getComHandleFromPort(port);
  return comhandle->txQueue->used;
}

Ecode_t COM_WriteByte(COM_Port_t port, uint8_t dataByte)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  return COM_WriteData(port, &dataByte, 1);
}

Ecode_t COM_WriteHex(COM_Port_t port, uint8_t dataByte)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  uint8_t hex[2];
  emWriteHexInternal(hex, dataByte, 2);
  return COM_WriteData(port, hex, 2);
}

Ecode_t COM_WriteString(COM_Port_t port, PGM_P string)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
#ifdef COM_VCP_ENABLE
  if (checkValidVcpPort(port)) {
    emDebugSendVuartMessage((uint8_t*)string, strlen(string));
    return EMBER_SUCCESS;
  }
#endif //COM_VCP_ENABLE
  COM_Handle_t comhandle = getComHandleFromPort(port);
  uint8_t *fifohead = &comhandle->txQueue->fifo[comhandle->txQueue->head];
  uint8_t length = 0;
  uint8_t wraplength = 0;
  uint8_t txlength = 0;
  while (*string != '\0') {
    while (!getOutputFifoSpace(comhandle, 0)) {
      if (comhandle->txPaused) {
        return EMBER_SERIAL_TX_OVERFLOW;
      }
    }
    ;
    CORE_DECLARE_IRQ_STATE;
    CORE_ENTER_ATOMIC();
    FIFO_ENQUEUE(comhandle->txQueue, *string, comhandle->txsize);
    CORE_EXIT_ATOMIC();
    string++;
    length++;
    // queue just wrapped
    if (comhandle->txQueue->head == 0) {
      // store first transmit length
      txlength = length - wraplength;
      // transmit chunk
      txBuffer(port, fifohead, txlength);
      wraplength += txlength;
      // move fifohead back to start
      fifohead = comhandle->txQueue->fifo;
    }
  }

  if ( length > wraplength) {
    txBuffer(port, fifohead, length - wraplength);
  }
  return EMBER_SUCCESS;
}

Ecode_t COM_PrintCarriageReturn(COM_Port_t port)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  return COM_Printf(port, "\r\n");
}

Ecode_t COM_PrintfVarArg(COM_Port_t port, PGM_P formatString, va_list ap)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  Ecode_t stat = EMBER_SUCCESS;
  if (!emPrintfInternal(COM_WriteData, port, formatString, ap)) {
    stat = EMBER_ERR_FATAL;
  }
  return stat;
}

Ecode_t COM_Printf(COM_Port_t port, PGM_P formatString, ...)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  Ecode_t stat;
  va_list ap;
  va_start(ap, formatString);
  stat = COM_PrintfVarArg(port, formatString, ap);
  va_end(ap);
  return stat;
}

Ecode_t COM_PrintfLine(COM_Port_t port, PGM_P formatString, ...)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  Ecode_t stat;
  va_list ap;
  va_start(ap, formatString);
  stat = COM_PrintfVarArg(port, formatString, ap);
  va_end(ap);
  COM_PrintCarriageReturn(port);
  return stat;
}
#if defined (__IAR_SYSTEMS_ICC__)
__weak Ecode_t COM_WriteData(COM_Port_t port, uint8_t *data, uint8_t length)
#else
__attribute__((weak)) Ecode_t COM_WriteData(COM_Port_t port, uint8_t *data, uint8_t length)
#endif
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
#ifdef COM_VCP_ENABLE
  if (checkValidVcpPort(port)) {
    emDebugSendVuartMessage(data, length);
    return EMBER_SUCCESS;
  }
#endif //COM_VCP_ENABLE
  COM_Handle_t comhandle = getComHandleFromPort(port);

